---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalDiscrepancyWarning
source: html/7bb6cd32-140b-da57-35f7-21096f328015.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalDiscrepancyWarning Property

Distance between Analytical and Physical Models of Structural Element is beyond tolerance of [Value]

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalDiscrepancyWarning { get; }
```